[
    {
        "title": "Blindsight",
        "optional": "Standard rule",
        "icon": "echoripples",
        "subtitle": "Perceive without sight",
        "description": "A creature with blindsight perceives its surroundings within a specific radius without relying on sight, negating invisibility and darkness.",
        "reference": "PHB, pg. 183, MM pg. 8.",
        "tags": ["environment_vision"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This special sense relies on non-visual means like echolocation or heightened senses. It allows a creature to 'see' its immediate surroundings, even with its eyes closed or in total darkness, and has the following specific traits:"
            },
            {
                "type": "list",
                "items": [
                    "It's common to creatures without eyes (oozes) or those with heightened senses (bats, true dragons).",
                    "It functions in all forms of darkness, including magical, and penetrates invisibility and visual illusions.",
                    "A creature with blindsight can still be subject to the blinded condition if its precise sense is impaired (e.g., a bat in an area of magical silence)."
                ]
            },
            {
                "type": "paragraph",
                "content": "Despite its effectiveness, blindsight does not perceive color or visual writing. It only pinpoints the location, size, and general shape of creatures and objects."
            }
        ]
    },
    {
        "title": "Bright light",
        "optional": "Standard rule",
        "icon": "starpupil",
        "subtitle": "Normal vision",
        "description": "In bright light, such as direct sunlight or the area of a torch, most creatures can see normally.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_light"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This is the default lighting condition for most daytime encounters and well-lit interiors. Under bright light, vision is unimpeded, though it can negatively affect certain creatures."
            },
            {
                "type": "list",
                "items": [
                    "Common sources include direct sunlight, the radius of a <b>Daylight</b> spell, or the immediate area of torches and lanterns.",
                    "Some creatures, such as drow and kobolds, have the <b>Sunlight Sensitivity</b> trait, giving them disadvantage on attack rolls and sight-based Perception checks while in direct sunlight."
                ]
            },
            {
                "type": "paragraph",
                "content": "The transition from bright light to dim light or darkness is an important tactical consideration, creating areas of shadow that can be used for concealment."
            }
        ]
    },
    {
        "title": "Darkness",
        "optional": "Standard rule",
        "icon": "worriedeyes",
        "subtitle": "Heavily obscured",
        "description": "Darkness creates a heavily obscured area, effectively blinding any creature trying to see within or through it without special senses.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_light"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Complete darkness blocks vision entirely, imposing the Blinded condition on creatures trying to see within the area. Navigating darkness often requires special senses or magic."
            },
            {
                "type": "list",
                "items": [
                    "Examples include unlit dungeons, moonless nights, or areas of magical darkness created by spells like <b>Darkness</b>.",
                    "Creatures with <b>Darkvision</b> can see in non-magical darkness as if it were dim light, but they do so in shades of gray.",
                    "Magical darkness blocks even Darkvision."
                ]
            },
            {
                "type": "paragraph",
                "content": "The distinction between magical and non-magical darkness is crucial, as only the most powerful senses, like Truesight, can pierce magical darkness."
            }
        ]
    },
    {
        "title": "Darkvision",
        "optional": "Standard rule",
        "icon": "semiclosedeye",
        "subtitle": "Limited vision in darkness",
        "description": "This common trait allows a creature to see in darkness as if it were dim light, and in dim light as if it were bright light.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_vision"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Darkvision is not perfect sight in the dark. It allows a creature to navigate and fight, but with a key penalty to perception in total darkness. Darkvision works as follows:"
            },
            {
                "type": "list",
                "items": [
                    "Within its specified range, a creature treats <b>dim light as if it were bright light</b>, and <b>darkness as if it were dim light</b>.",
                    "Because darkness is treated as dim light, a creature relying on darkvision in total darkness still has disadvantage on Wisdom (Perception) checks that rely on sight.",
                    "A creature with darkvision can't discern color in darkness, only shades of gray."
                ]
            },
            {
                "type": "paragraph",
                "content": "This means a character with darkvision is still less likely to spot a hidden trap or a hiding creature in total darkness than they would be in bright light."
            }
        ]
    },
    {
        "title": "Dim light",
        "optional": "Standard rule",
        "icon": "semiclosedeye",
        "subtitle": "Lightly obscured",
        "description": "Dim light, also called shadows, creates a lightly obscured area where creatures have disadvantage on sight-based Perception checks.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_light"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Dim light represents areas of partial shadow, like at twilight, on a moonlit night, or at the edge of a torch's radius. Vision is hindered but not blocked, and its primary effect is impacting perception."
            },
            {
                "type": "list",
                "items": [
                    "Any creature in dim light has disadvantage on Wisdom (Perception) checks that rely on sight.",
                    "Common sources include twilight, dawn, or the light of a full moon.",
                    "Creatures with <b>Darkvision</b> can see in dim light as if it were bright light, removing the disadvantage."
                ]
            },
            {
                "type": "paragraph",
                "content": "While you cannot hide from a creature that can see you in dim light, it provides an opportunity to attempt to hide if you can break line of sight."
            }
        ]
    },
    {
        "title": "Falling",
        "optional": "Standard rule",
        "icon": "falling",
        "subtitle": "1d6 per 10 feet (max 20d6)",
        "description": "A creature takes 1d6 bludgeoning damage for every 10 feet it falls, to a maximum of 20d6, and lands prone.",
        "reference": "PHB, pg. 183; XGE, pg. 77.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Falling is a significant hazard where damage caps out at 20d6, representing terminal velocity. The rules for falling also include specifics for flying creatures and the speed of descent."
            },
            {
                "type": "list",
                "items": [
                    "<b>Rate of Fall (XGE):</b> A creature falls 500 feet instantly. If still falling at the end of its turn, it descends another 500 feet.",
                    "<b>Flying Creatures:</b> If a flying creature is knocked prone, has its speed reduced to 0, or is otherwise deprived of the ability to move, it falls unless it can hover or is saved by magic."
                ]
            },
            {
                "type": "paragraph",
                "content": "The instantaneous 500-foot fall rule means that even with a spell like <b>Feather Fall</b>, which has a casting time of 1 reaction, a creature will fall a significant distance before the spell can be cast."
            }
        ]
    },
    {
        "title": "Half cover",
        "optional": "Standard rule",
        "icon": "brokenshield",
        "subtitle": "+2 AC & Dex saves",
        "description": "An obstacle covering at least half of your body grants a +2 bonus to AC and Dexterity saving throws.",
        "reference": "PHB, pg. 196.",
        "tags": ["environment_cover"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Half cover is the most common type of cover, representing taking shelter behind a low wall, a tree, or even another creature. The benefits are simple and effective:"
            },
            {
                "type": "list",
                "items": [
                    "It provides a <b>+2 bonus to both AC and Dexterity saving throws</b>.",
                    "Examples include a low wall, a large piece of furniture, a narrow tree trunk, or another creature (whether friendly or hostile)."
                ]
            },
            {
                "type": "paragraph",
                "content": "This bonus makes you a harder target for both direct attacks and area effects that require you to be nimble, like a dragon's breath weapon."
            }
        ]
    },
    {
        "title": "Heavily obscured",
        "optional": "Standard rule",
        "icon": "fog",
        "subtitle": "Effectively blinded",
        "description": "An area is heavily obscured if it blocks vision entirely, such as in darkness, opaque fog, or dense foliage.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_obscurance"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "A creature trying to see something in a heavily obscured area is effectively suffering from the Blinded condition. This has severe implications for combat:"
            },
            {
                "type": "list",
                "items": [
                    "A creature in a heavily obscured area effectively has the <b>blinded condition</b> when trying to see anything in that area.",
                    "This means it automatically fails any ability check that requires sight.",
                    "Attack rolls against the creature have advantage, and the creature's own attack rolls have disadvantage."
                ]
            },
            {
                "type": "paragraph",
                "content": "This is a key condition for stealth, as you must be heavily obscured from a creature to attempt to Hide from it."
            }
        ]
    },
    {
        "title": "Lightly obscured",
        "optional": "Standard rule",
        "icon": "dustcloud",
        "subtitle": "Disadvantage on Perception",
        "description": "An area is lightly obscured if something hinders sight, such as dim light, light fog, or moderate foliage.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_obscurance"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Lightly obscured areas make it more difficult to notice details, but do not prevent targeting or line of sight. The main mechanical effect is a penalty to perception:"
            },
            {
                "type": "list",
                "items": [
                    "Creatures in the area have <b>disadvantage on Wisdom (Perception)</b> checks that rely on sight.",
                    "You cannot attempt to hide while you are only lightly obscured from a creature; you must be heavily obscured."
                ]
            },
            {
                "type": "paragraph",
                "content": "This condition's primary effect is making it easier for traps or hidden creatures to go unnoticed."
            }
        ]
    },
    {
        "title": "Suffocating",
        "optional": "Standard rule",
        "icon": "drowning",
        "subtitle": "Holding your breath",
        "description": "Deprived of air, you can survive for a limited time before you drop to 0 hit points and begin dying.",
        "reference": "PHB, pg. 183.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "A creature can hold its breath for a number of minutes equal to 1 + its Constitution modifier (minimum 30 seconds). When it runs out of breath, it enters a deadly countdown:"
            },
            {
                "type": "list",
                "items": [
                    "After running out of breath, you can survive for a number of rounds equal to your Constitution modifier (minimum 1 round).",
                    "At the start of your next turn after this, you drop to 0 hit points and begin dying.",
                    "A suffocating creature can't regain hit points or be stabilized until it can breathe again."
                ]
            },
            {
                "type": "paragraph",
                "content": "This final rule is critical: the inability to regain hit points or be stabilized while unable to breathe makes this an incredibly dangerous situation, as even powerful healing magic is useless."
            }
        ]
    },
    {
        "title": "Three-quarters cover",
        "optional": "Standard rule",
        "icon": "crackedshield",
        "subtitle": "+5 AC & Dex saves",
        "description": "An obstacle covering about three-quarters of your body grants a significant +5 bonus to AC and Dexterity saving throws.",
        "reference": "PHB, pg. 196.",
        "tags": ["environment_cover"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This level of cover represents being mostly concealed, leaving only a small part of you exposed. It provides a major defensive advantage, offering a massive defensive boost:"
            },
            {
                "type": "list",
                "items": [
                    "It provides a <b>+5 bonus to both AC and Dexterity saving throws</b>.",
                    "Examples include a portcullis, an arrow slit, or a thick tree trunk."
                ]
            },
            {
                "type": "paragraph",
                "content": "A +5 bonus is equivalent to the best nonmagical shield and heavy armor combined. Seeking out three-quarters cover is a highly effective defensive tactic."
            }
        ]
    },
    {
        "title": "Total cover",
        "optional": "Standard rule",
        "icon": "shield",
        "subtitle": "Cannot be targeted directly",
        "description": "You are completely concealed by an obstacle, making you immune to being directly targeted by attacks or spells.",
        "reference": "PHB, pg. 196.",
        "tags": ["environment_cover"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Total cover means there is no clear path between you and your attacker. It is the ultimate form of protection from effects that require line of sight or a direct path."
            },
            {
                "type": "list",
                "items": [
                    "A target with total cover <b>cannot be targeted directly</b> by an attack or a spell.",
                    "An attack or spell can still affect a target with total cover through an area of effect if the effect can spread around the obstacle (e.g., the explosion from a <b>Fireball</b>)."
                ]
            },
            {
                "type": "paragraph",
                "content": "This forces enemies to reposition or use area-of-effect abilities to harm you, making it a powerful tactical tool."
            }
        ]
    },
    {
        "title": "Truesight",
        "optional": "Standard rule",
        "icon": "eyeshield",
        "subtitle": "See true forms",
        "description": "This powerful sense allows a creature to see through darkness, invisibility, illusions, and transformations to perceive reality as it is.",
        "reference": "PHB, pg. 184, MM pg. 9.",
        "tags": ["environment_vision"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Truesight is the ultimate form of perception, cutting through nearly all forms of magical and nonmagical concealment within its specified range. A creature with truesight has the following capabilities:"
            },
            {
                "type": "list",
                "items": [
                    "It sees normally in both magical and nonmagical darkness.",
                    "It sees invisible creatures and objects as if they were visible.",
                    "It automatically detects visual illusions and succeeds on saving throws against them.",
                    "It perceives the true form of shapechangers or creatures that are transformed by magic.",
                    "It can see into the Ethereal Plane from the Material Plane."
                ]
            },
            {
                "type": "paragraph",
                "content": "A creature with truesight is an incredibly dangerous foe for parties that rely on stealth, illusions, or magical darkness."
            }
        ]
    },
    {
        "title": "Underwater Combat",
        "optional": "Standard rule",
        "icon": "atsea",
        "subtitle": "Fighting in water",
        "description": "Combat while fully submerged is difficult for creatures without a swim speed, imposing penalties on most weapon attacks.",
        "reference": "PHB, pg. 198.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Water impedes movement and the force of blows. Any creature fully submerged that does not have a natural swim speed is subject to the following rules:"
            },
            {
                "type": "list",
                "items": [
                    "<b>Melee Attacks:</b> A creature without a swimming speed has <b>disadvantage</b> on melee weapon attack rolls unless the weapon is a dagger, javelin, shortsword, spear, or trident.",
                    "<b>Ranged Attacks:</b> Ranged weapon attacks automatically miss targets beyond the weapon's normal range. Within normal range, the attack has <b>disadvantage</b> unless it is a crossbow, net, or thrown weapon like a javelin.",
                    "<b>Fire Resistance:</b> Any creature or object fully immersed in water has resistance to fire damage."
                ]
            },
            {
                "type": "paragraph",
                "content": "These rules make aquatic combat a specialized challenge where weapon choice and movement are critically important."
            }
        ]
    },
    {
        "title": "Extreme Cold*",
        "optional": "Optional rule",
        "icon": "thermometercold",
        "subtitle": "Risk of Exhaustion",
        "description": "Prolonged exposure to temperatures at or below 0째 F (-18째 C) forces Constitution saves to resist gaining levels of exhaustion.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "When exposed to extreme cold, a creature must succeed on a <b>DC 10 Constitution saving throw</b> at the end of each hour or gain one level of <b>Exhaustion</b>. Creatures with resistance or immunity to cold damage automatically succeed, as do those wearing appropriate cold-weather gear or those naturally adapted to cold climates."
            }
        ]
    },
    {
        "title": "Extreme Heat*",
        "optional": "Optional rule",
        "icon": "sun",
        "subtitle": "Risk of Exhaustion",
        "description": "Prolonged exposure to temperatures at or above 100째 F (38째 C) forces Constitution saves to resist gaining levels of exhaustion.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "When exposed to extreme heat, a creature must make a Constitution saving throw at the end of each hour or gain one level of <b>Exhaustion</b>. The save DC and modifiers are as follows:"
            },
            {
                "type": "list",
                "items": [
                    "The DC is <b>5 for the first hour and increases by 1</b> for each additional hour.",
                    "Creatures wearing medium armor, heavy armor, or heavy clothing have <b>disadvantage</b> on the save.",
                    "Creatures with resistance or immunity to fire damage automatically succeed, as do those naturally adapted to hot climates."
                ]
            },
            {
                "type": "paragraph",
                "content": "The escalating DC makes it increasingly difficult to survive long journeys through deserts or other hot environments without adequate water and shelter."
            }
        ]
    },
    {
        "title": "Flanking*",
        "optional": "Optional rule",
        "icon": "confrontation",
        "subtitle": "Gain advantage for positioning",
        "description": "A popular optional rule where two allies on opposite sides of an enemy gain advantage on their melee attacks against it.",
        "reference": "DMG, pg. 251.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Flanking heavily encourages tactical movement and teamwork in combat, making positioning even more critical. The rule is as follows:"
            },
            {
                "type": "list",
                "items": [
                    "When a creature and at least one of its allies are adjacent to an enemy and on opposite sides or corners of the enemy's space, they flank that enemy, and each of them has <b>advantage on melee attack rolls</b> against it.",
                    "A creature can't be flanked if it is formless or has a feature that says it can't be flanked.",
                    "A common variant grants a +2 bonus to attack rolls instead of advantage to reduce the frequency of advantage."
                ]
            },
            {
                "type": "paragraph",
                "content": "This rule can make combat much faster and deadlier, as advantage becomes significantly more common for both players and monsters."
            }
        ]
    },
    {
        "title": "Heavy Precipitation*",
        "optional": "Optional rule",
        "icon": "raining",
        "subtitle": "Affects perception and fire",
        "description": "Heavy rain or snowfall lightly obscures the area, imposes disadvantage on hearing checks, and extinguishes open flames.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Heavy precipitation adds atmospheric and mechanical challenges to an environment, making travel and perception more difficult. It has the following effects:"
            },
            {
                "type": "list",
                "items": [
                    "It creates a <b>Lightly Obscured</b> area, imposing disadvantage on Wisdom (Perception) checks that rely on sight.",
                    "Heavy rain also imposes <b>disadvantage on Wisdom (Perception)</b> checks that rely on hearing.",
                    "It extinguishes open flames, such as candles and torches."
                ]
            },
            {
                "type": "paragraph",
                "content": "These effects can neutralize common light sources and make it harder to spot or hear approaching danger, adding tension to outdoor encounters."
            }
        ]
    },
    {
        "title": "High Altitude*",
        "optional": "Optional rule",
        "icon": "mountainclimbing",
        "subtitle": "Risk of Exhaustion",
        "description": "At altitudes of 10,000 feet or higher, creatures not acclimated must make Constitution saves to resist exhaustion.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "When traveling at altitudes of 10,000 feet or higher, a creature must make a <b>DC 10 Constitution saving throw</b> for every hour of travel past 8 hours in a day. On a failure, they gain one level of <b>Exhaustion</b>. Creatures acclimated to high altitude automatically succeed on this saving throw. A creature can become acclimated by spending 30 days at that altitude."
            }
        ]
    },
    {
        "title": "Lingering Injuries*",
        "optional": "Optional rule",
        "icon": "swordbreak",
        "subtitle": "Lasting wounds from combat",
        "description": "An optional rule to add lasting mechanical consequences when a creature suffers a critical hit or drops to 0 HP.",
        "reference": "DMG, pg. 272.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This rule is for campaigns that want a grittier, more dangerous feel, where the scars of battle are more than just lost hit points. When a lingering injury is triggered, the DM can have the player roll on a table for a random effect."
            },
            {
                "type": "list",
                "items": [
                    "Examples include: <b>Lose an Eye</b> (disadvantage on ranged attacks and sight-based Perception), <b>Limp</b> (speed reduced by 5 ft), or a <b>Horrible Scar</b> (disadvantage on Persuasion, advantage on Intimidation)."
                ]
            },
            {
                "type": "paragraph",
                "content": "These injuries often require powerful magic like <b>Regenerate</b> or significant downtime to heal, creating new challenges and roleplaying opportunities."
            }
        ]
    },
    {
        "title": "Massive Damage*",
        "optional": "Optional rule",
        "icon": "internalinjury",
        "subtitle": "Risk of System Shock",
        "description": "This optional rule forces a DC 15 Constitution save when a creature takes damage equal to or greater than half its HP maximum from a single source.",
        "reference": "DMG, pg. 273.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This rule makes combat more unpredictable, as even a high-health character can be taken out of a fight by a single, powerful blow. When a creature takes massive damage, it must make a save or suffer a random effect."
            },
            {
                "type": "list",
                "items": [
                    "When a creature takes damage from a single source equal to or greater than <b>half its hit point maximum</b>, it must succeed on a <b>DC 15 Constitution saving throw</b>.",
                    "On a failure, the creature suffers a random effect from the System Shock table, such as reeling, speed dropping to 0, or being stunned."
                ]
            },
            {
                "type": "paragraph",
                "content": "A failed save can have a devastating impact, potentially stunning a character or reducing their speed to zero at a critical moment."
            }
        ]
    },
    {
        "title": "Morale*",
        "optional": "Optional rule",
        "icon": "terror",
        "subtitle": "Will enemies flee or surrender?",
        "description": "An optional rule providing a mechanic for determining if NPCs flee or surrender when a fight turns against them.",
        "reference": "DMG, pg. 273.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Morale rules help create more realistic encounters where not every fight is to the death. The DM can call for a morale check when certain events occur:"
            },
            {
                "type": "list",
                "items": [
                    "<b>Triggers for a morale check:</b> The enemy group is surprised, reduced to half its numbers, or its leader is defeated.",
                    "The DM can ask the group's leader to make a DC 10 Wisdom saving throw. On a failure, the group breaks.",
                    "The DC might be modified by the situation (e.g., higher if the PCs are terrifying, lower if the monsters are defending their lair)."
                ]
            },
            {
                "type": "paragraph",
                "content": "This can lead to more dynamic outcomes, such as chases, hostage situations, or enemies that return later with reinforcements."
            }
        ]
    },
    {
        "title": "Rest Variants*",
        "optional": "Optional rule",
        "icon": "nightsleep",
        "subtitle": "Change game pacing",
        "description": "These optional rules change the duration of short and long rests to fundamentally alter the pacing of a campaign.",
        "reference": "DMG, pg. 267.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "The standard rest rules create a certain rhythm of adventuring. By changing the time required for rests, you can create a vastly different game experience. The two main variants are Epic Heroism and Gritty Realism."
            },
            {
                "type": "list",
                "items": [
                    "<b>Epic Heroism:</b> A short rest is 5 minutes, and a long rest is 1 hour. This is for high-action, fast-paced games where resources replenish quickly.",
                    "<b>Gritty Realism:</b> A short rest is 8 hours, and a long rest is 7 days. This makes encounters more dangerous and encourages careful resource management."
                ]
            },
            {
                "type": "paragraph",
                "content": "Choosing a rest variant is a major decision that should be discussed in a session zero, as it deeply impacts how all classes manage their abilities."
            }
        ]
    },
    {
        "title": "Slippery Ice*",
        "optional": "Optional rule",
        "icon": "icecube",
        "subtitle": "Difficult Terrain, risk of falling",
        "description": "Slippery ice is difficult terrain and requires a DC 10 Dexterity (Acrobatics) check to cross without falling prone.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This simple rule can turn a frozen lake or icy cavern into a treacherous and comical battlefield. The rules for slippery ice are as follows:"
            },
            {
                "type": "list",
                "items": [
                    "Slippery ice is <b>Difficult Terrain</b>, meaning each foot of movement costs one extra foot of speed.",
                    "When a creature moves onto a slippery ice surface for the first time on a turn, it must succeed on a <b>DC 10 Dexterity (Acrobatics) check</b> or fall prone."
                ]
            },
            {
                "type": "paragraph",
                "content": "Characters with high Acrobatics skills will shine in these environments, while those in heavy armor will struggle to keep their footing."
            }
        ]
    },
    {
        "title": "Strong Wind*",
        "optional": "Optional rule",
        "icon": "windsock",
        "subtitle": "Affects attacks and perception",
        "description": "Strong wind imposes disadvantage on ranged weapon attacks and hearing-based Perception checks, and can hinder flight.",
        "reference": "DMG, pg. 110.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Wind can be a major factor in outdoor encounters, hampering ranged combatants and making the environment itself a threat. The effects of wind vary by its speed:"
            },
            {
                "type": "list",
                "items": [
                    "A <b>strong wind</b> (21 to 30 mph) imposes disadvantage on ranged weapon attack rolls and on Wisdom (Perception) checks that rely on hearing. It also extinguishes open flames and disperses fog.",
                    "A flying creature in a strong wind must land at the end of its turn or fall.",
                    "A <b>gale</b> (31-50 mph) has the same effects, plus it makes nonmagical flight impossible. Ranged weapon attacks are impossible."
                ]
            },
            {
                "type": "paragraph",
                "content": "These rules make weather an important tactical consideration, potentially forcing archers and flying creatures to change their strategies."
            }
        ]
    },
    {
        "title": "Traps*",
        "optional": "Optional rule",
        "icon": "tripwire",
        "subtitle": "Hidden dangers",
        "description": "Traps are hidden hazards, either mechanical or magical, that require Perception to spot and specific skills to disable.",
        "reference": "DMG, pgs. 120-121; XGE, pgs. 113-123.",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "Traps challenge players to be cautious and observant, ranging from simple pitfalls to elaborate, multi-stage challenges. Detecting and disabling them requires specific skills and tools."
            },
            {
                "type": "list",
                "items": [
                    "A trap's description specifies the checks and DCs to find and disable it. Finding a trap usually requires a Wisdom (Perception) check. Disabling it may require a Dexterity check with thieves' tools or an Intelligence (Investigation) check.",
                    "Magical traps may require a successful <b>Dispel Magic</b> spell to disable.",
                    "<b>Complex Traps (XGE):</b> These traps act on initiative, have their own actions and reactions, and can change over time, making them more like a combat encounter than a single hazard."
                ]
            },
            {
                "type": "paragraph",
                "content": "Well-placed traps can drain party resources, split the group, or soften them up before a major combat encounter."
            }
        ]
    },
    {
        "title": "Critical Fumbles**",
        "optional": "Homebrew rule",
        "icon": "brokenshield",
        "subtitle": "Natural 1 has consequences",
        "description": "A popular house rule where rolling a natural 1 on an attack roll results in a negative consequence beyond merely missing.",
        "reference": "Common Homebrew",
        "tags": ["environment_other"],
        "bullets": [
            {
                "type": "paragraph",
                "content": "This house rule makes combat more chaotic and unpredictable. While popular, it can disproportionately penalize martial characters who make more attack rolls. Fumbles can be simple or determined by rolling on a chart."
            },
            {
                "type": "list",
                "items": [
                    "<b>Simple Fumble:</b> On a natural 1, the attacker falls prone or drops their weapon.",
                    "<b>Complex Fumble:</b> Rolling on a chart might cause effects like hitting an ally, breaking a nonmagical weapon, or dealing a small amount of damage to yourself."
                ]
            },
            {
                "type": "paragraph",
                "content": "It's often recommended that if fumble rules are used for players, they should also apply to monsters to maintain fairness."
            }
        ]
    }
]