[
    {
        "title": "Cast a Spell",
        "optional": "Standard rule",
        "icon": "magicswirl",
        "subtitle": "Cast time of 1 bonus action",
        "description": "Cast a spell with a casting time of 1 bonus action.",
        "reference": "PHB, pg. 202.",
        "bullets": [
            "You can't cast another spell during the same turn, except for a cantrip with a casting time of 1 action.",
            "This is a common point of confusion: if you cast <i>Misty Step</i> (a bonus action spell), you can only cast a cantrip like <i>Fire Bolt</i> with your action, not another leveled spell like <i>Magic Missile</i>."
        ]
    },
    {
        "title": "Offhand Attack",
        "optional": "Standard rule",
        "icon": "crossedswords",
        "subtitle": "Use with the Attack action",
        "description": "Attack with your off-hand weapon.",
        "reference": "PHB, pg. 195.",
        "bullets": [
            "When you take the <i>Attack</i> action and attack with a <b>light</b> melee weapon you're holding in one hand, you can use a bonus action to attack with a different <b>light</b> melee weapon in your other hand.",
            "You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative.",
            "If either weapon has the thrown property, you can throw it instead of making a melee attack.",
            "The <i>Two-Weapon Fighting</i> fighting style allows you to add your ability modifier to the damage. The <i>Dual Wielder</i> feat removes the 'light' weapon requirement."
        ]
    },
    {
        "title": "Use Class Feature",
        "optional": "Standard rule",
        "icon": "embrassedenergy",
        "subtitle": "Some features use bonus actions",
        "description": "Use a racial or class feature that uses a bonus action.",
        "reference": "See class page for more information.",
        "bullets": [
            "Examples include a Rogue's Cunning Action, a Monk's Martial Arts or Ki abilities, a Barbarian's Rage, or a Cleric's War Priest feature."
        ]
    },
    {
        "title": "Aim*",
        "optional": "Optional rule",
        "icon": "archerytarget",
        "subtitle": "Gain advantage on an attack",
        "description": "As a bonus action, you can give yourself advantage on your next attack roll on the current turn. You can use this bonus action only if you haven't moved during this turn, and after you use the bonus action, your speed is 0 until the end of the current turn.",
        "reference": "TCE, pg. 46.",
        "bullets": [
            "<b>(Optional Rule – TCE):</b>",
            "This action allows you to trade all of your movement for a higher chance to hit.",
            "You must not have moved yet on your turn.",
            "Using this bonus action reduces your speed to 0 for the rest of the turn."
        ]
    },
    {
        "title": "Overrun*",
        "optional": "Optional rule",
        "icon": "shieldbash",
        "subtitle": "Run through a hostile space",
        "description": "When a creature tries to move through a hostile creature's space, the mover can try to force its way through by overrunning the hostile creature.",
        "reference": "DMG, pg. 272.",
        "bullets": [
            "<b>(Optional Rule – DMG):</b>",
            "As an action or a bonus action, the mover makes a Strength (Athletics) check contested by the hostile creature's Strength (Athletics) check.",
            "The mover has <b>advantage</b> if it is larger, or <b>disadvantage</b> if it is smaller.",
            "If the mover wins, it can move through the hostile creature's space once this turn."
        ]
    },
    {
        "title": "Tumble*",
        "optional": "Optional rule",
        "icon": "tumble",
        "subtitle": "Tumble through a hostile space",
        "description": "A creature can try to tumble through a hostile creature's space, ducking and weaving past the opponent.",
        "reference": "DMG, pg. 272.",
        "bullets": [
            "<b>(Optional Rule – DMG):</b>",
            "As an action or a bonus action, the tumbler makes a Dexterity (Acrobatics) check contested by the hostile creature's Dexterity (Acrobatics) check.",
            "If the tumbler wins, it can move through the hostile creature's space once this turn."
        ]
    },
    {
        "title": "Drink a Potion **",
        "optional": "Homebrew rule",
        "icon": "potionball",
        "subtitle": "Quaff a potion quickly",
        "description": "A very common house rule to make potions more viable in combat.",
        "bullets": [
            "<b>(Common Homebrew Rule):</b>",
            "<b>Variant 1 (Most Common):</b> You can drink a potion yourself as a bonus action. Administering a potion to another creature is still an action.",
            "<b>Variant 2 (Uncommon):</b> You can drink a potion as a bonus action, but you only receive the rolled amount of healing. If you use your full action, you receive the maximum possible healing from the potion."
        ]
    },
    {
        "title": "Feint **",
        "optional": "Homebrew rule",
        "icon": "aura",
        "subtitle": "Gain advantage on your attack",
        "description": "A common house rule to allow a creature to outwit an opponent, granting advantage on its own attack. This is normally reserved for the Battle Master Fighter.",
        "bullets": [
            "<b>(Uncommon Homebrew Rule):</b>",
            "As a bonus action, make a Charisma (Deception) check contested by the target's Wisdom (Insight).",
            "If you succeed, you gain advantage on your next attack roll against that creature this turn."
        ]
    },
    {
        "title": "Swap Weapons **",
        "optional": "Homebrew rule",
        "icon": "recycle",
        "subtitle": "Sheathe one, draw another",
        "description": "A house rule to bypass the strict 'one free object interaction' rule, which normally prevents drawing and sheathing in the same turn without the Dual Wielder feat.",
        "bullets": [
            "<b>(Uncommon Homebrew Rule):</b>",
            "As a bonus action, you can sheathe a weapon you are holding and draw a different weapon. By RAW, this would require your action after using your free object interaction to do one of the two."
        ]
    }
]