[
    {
        "title": "Climb",
        "optional": "Standard rule",
        "icon": "crags",
        "subtitle": "Cost: +1ft per 1ft",
        "description": "Movement cost: Each foot of movement costs 1 extra foot (2ft total).",
        "reference": "PHB, pg. 182.",
        "bullets": [
            "A creature with a climbing speed ignores this extra cost.",
            "The DM might require a Strength (Athletics) check for a particularly difficult or slippery surface."
        ]
    },
    {
        "title": "Crawl",
        "optional": "Standard rule",
        "icon": "crawl",
        "subtitle": "Cost: +1ft per 1ft",
        "description": "Movement cost: Each foot of movement costs 1 extra foot (2ft total).",
        "reference": "PHB, pg. 182.",
        "bullets": [
            "Crawling is the only way to move while you have the Prone condition (unless you use magic)."
        ]
    },
    {
        "title": "Difficult Terrain",
        "optional": "Standard rule",
        "icon": "stonepile",
        "subtitle": "Cost modifier: +1ft per 1ft",
        "reference": "PHB, pg. 182.",
        "description": "Moving in difficult terrain costs 1 extra foot of speed for every 1 foot moved.",
        "bullets": [
            "Examples: Low furniture, rubble, undergrowth, steep stairs, snow, shallow bogs, and the space of another creature.",
            "Some features, like the Ranger's Natural Explorer, allow you to ignore difficult terrain."
        ]
    },
    {
        "title": "Drop Prone",
        "optional": "Standard rule",
        "icon": "falling",
        "subtitle": "Cost: 0ft",
        "description": "You can drop prone without using any of your speed.",
        "reference": "PHB, pgs. 190-191.",
        "bullets": [
            "This is not an action and costs no movement.",
            "To move while prone, you must crawl or use magic.",
            "Dropping prone gives you the <i>Prone</i> condition."
        ]
    },
    {
        "title": "Grapple Move",
        "optional": "Standard rule",
        "icon": "grab",
        "subtitle": "Modifier: speed halved",
        "description": "Drag or carry the grappled creature with you.",
        "reference": "PHB, pg. 195.",
        "bullets": [
            "If you move while grappling another creature, your speed is <b>halved</b> for the turn, unless the creature is two or more sizes smaller than you.",
            "This penalty to your total speed applies before other movement costs. For example, with a 30ft speed, you'd have 15ft of movement. Moving 5ft through difficult terrain would then cost 10ft of that 15ft pool."
        ]
    },
    {
        "title": "High Jump",
        "optional": "Standard rule",
        "icon": "wingfoot",
        "subtitle": "Height: 3 + STR MOD feet",
        "description": "You leap into the air a number of feet equal to 3 + your Strength modifier.",
        "reference": "PHB, pg. 182.",
        "bullets": [
            "This is for a <b>running high jump</b>, which requires moving at least 10 feet on foot immediately before.",
            "A <b>standing high jump</b> is only half that distance.",
            "You can extend your arms half your height above yourself during the jump.",
            "Each foot you clear on the jump costs a foot of movement. The DM may rule you can't jump farther than your remaining movement."
        ]
    },
    {
        "title": "Long Jump",
        "optional": "Standard rule",
        "icon": "wingfoot",
        "subtitle": "Distance: STR score in feet",
        "description": "You cover a number of feet up to your Strength score.",
        "reference": "PHB, pg. 182.",
        "bullets": [
            "This is for a <b>running long jump</b>, which requires moving at least 10 feet on foot immediately before.",
            "A <b>standing long jump</b> is only half that distance.",
            "Each foot you clear on the jump costs a foot of movement.",
            "The DM may require a DC 10 Strength (Athletics) check to clear a low obstacle, or a DC 10 Dexterity (Acrobatics) check to land on difficult terrain."
        ]
    },
    {
        "title": "Move",
        "optional": "Standard rule",
        "icon": "run",
        "subtitle": "Cost: 1ft per 1ft",
        "description": "Movement cost: 1 foot of speed for every 1 foot moved.",
        "reference": "PHB, pgs. 182, 190.",
        "bullets": [
            "You can break up your movement during your turn, using some of your speed before and after your action.",
            "If you have multiple speeds (e.g., walking and flying), you can switch between them. Subtract the distance already moved from the new speed.",
            "You can move through a nonhostile creature's space. You can only move through a hostile creature's space if it is at least two sizes larger or smaller than you.",
            "Another creature's space is always difficult terrain for you.",
            "You can't willingly end your move in another creature's space."
        ]
    },
    {
        "title": "Mount/Dismount",
        "optional": "Standard rule",
        "icon": "horsehead",
        "subtitle": "Cost: half movement speed",
        "description": "Mount or dismount a creature within 5 feet of you.",
        "reference": "PHB, pg. 198.",
        "bullets": [
            "Once during your move, you can mount or dismount a creature that is within 5 feet of you. Doing so costs an amount of movement equal to half your speed.",
            "If an effect moves your mount against its will while you're on it, you must succeed on a <b>DC 10 Dexterity saving throw</b> or fall off, landing prone within 5 feet.",
            "If your mount is knocked prone, you can use your reaction to dismount it as it falls. Otherwise, you are dismounted and fall prone in a space within 5 feet of it."
        ]
    },
    {
        "title": "Squeezing",
        "optional": "Standard rule",
        "icon": "crawl",
        "subtitle": "Move through a smaller space",
        "description": "A creature can squeeze through a space that is large enough for a creature one size smaller than it.",
        "reference": "PHB, pg. 192.",
        "bullets": [
            "While squeezing, every foot of movement costs 1 extra foot (like difficult terrain).",
            "You have <b>disadvantage on attack rolls and Dexterity saving throws</b>.",
            "Attack rolls against you have <b>advantage</b>."
        ]
    },
    {
        "title": "Stand Up",
        "optional": "Standard rule",
        "icon": "strong",
        "subtitle": "Cost: half movement speed",
        "description": "Movement cost: half of your total speed.",
        "reference": "PHB, pgs. 190-191.",
        "bullets": [
            "You can't stand up if you don't have enough movement left or if your speed is 0.",
            "For example, if your speed is 30 feet, you must spend 15 feet of movement to stand up."
        ]
    },
    {
        "title": "Swim",
        "optional": "Standard rule",
        "icon": "atsea",
        "subtitle": "Cost: +1ft per 1ft",
        "description": "Movement cost: Each foot of movement costs 1 extra foot (2ft total).",
        "reference": "PHB, pg. 182.",
        "bullets": [
            "A creature with a swimming speed ignores this extra cost.",
            "The DM might require a Strength (Athletics) check for rough water or strong currents."
        ]
    },
    {
        "title": "Travel Pace",
        "optional": "Standard rule",
        "icon": "run",
        "subtitle": "Traveling for an hour or more",
        "description": "While traveling, a group of adventurers can move at a normal, fast, or slow pace.",
        "reference": "PHB, pgs. 181-182.",
        "bullets": [
            "<table><tr><th style='text-align:left'>Pace</th><th>Distance per Minute</th><th>Distance per Hour</th><th>Distance per Day</th><th style='text-align:left'>Effect</th></tr><tr><td>Fast</td><td>400 feet</td><td>4 miles</td><td>30 miles</td><td>-5 penalty to passive Wisdom (Perception) scores</td></tr><tr><td>Normal</td><td>300 feet</td><td>3 miles</td><td>24 miles</td><td>-</td></tr><tr><td>Slow</td><td>200 feet</td><td>2 miles</td><td>18 miles</td><td>Able to use stealth</td></tr></table>",
            "<b>Forced March:</b> For each additional hour of travel beyond 8 hours in a day, characters must make a Constitution saving throw at the end of the hour. The DC is 10 + 1 for each hour past 8. On a failed save, a character suffers one level of exhaustion."
        ]
    }
]