[
    {
        "title": "Blinded",
        "optional": "Standard rule",
        "icon": "oneeyed",
        "subtitle": "You can't see",
        "description": "A blinded creature has a total inability to see, making them a poor attacker and an easy target.",
        "reference": "PHB 2024, pg. 367-368.",
        "summary": "You automatically fail any d20 Test requiring sight. You have disadvantage on your attack rolls, and attack rolls against you have advantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Blinded condition represents a total loss of sight. A creature that cannot see automatically fails checks requiring sight and is at a significant disadvantage in combat."
            },
            {
                "type": "list",
                "items": [
                    "You automatically fail any d20 Test that requires sight.",
                    "You have <b>disadvantage on attack rolls</b>.",
                    "Attack rolls against you have <b>advantage</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "Creatures with alternative senses like Blindsight can still pinpoint your location, but the penalties to attack rolls remain unless their senses bypass the need for sight entirely for attacking."
            }
        ]
    },
    {
        "title": "Charmed",
        "optional": "Standard rule",
        "icon": "smitten",
        "subtitle": "You are charmed",
        "description": "You are magically charmed by another creature, preventing you from harming them and making you more susceptible to their influence.",
        "reference": "PHB 2024, pg. 367-368.",
        "summary": "You cannot attack the charmer or target them with harmful effects. The charmer also has advantage on Charisma checks made to interact socially with you.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Charmed condition represents a magical influence over emotions. It doesn't grant mind control, but it does protect the charmer and makes social interaction easier for them."
            },
            {
                "type": "list",
                "items": [
                    "You can't attack the charmer or target them with a harmful spell or ability.",
                    "The charmer has <b>advantage on Charisma checks</b> in social interaction with you."
                ]
            },
            {
                "type": "paragraph",
                "content": "A charmed creature might still refuse a harmful or out-of-character request, but they are inclined to be friendly and agreeable toward the charmer."
            }
        ]
    },
    {
        "title": "Dazed",
        "optional": "Standard rule",
        "icon": "internalinjury",
        "subtitle": "You have limited activity",
        "description": "A new condition that severely limits your action economy and breaks your concentration on spells.",
        "reference": "PHB 2024, pg. 367-368.",
        "summary": "You can take either an Action or a Bonus Action on your turn (not both), and you cannot concentrate on spells or other effects. You can still move and take a Reaction.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Dazed condition is a less punishing alternative to being stunned. A dazed creature can still act, but their options are severely limited for a turn, disrupting their plans and spellcasting."
            },
            {
                "type": "list",
                "items": [
                    "You can take either an Action or a Bonus Action on your turn, but not both. You can still move and take a Reaction.",
                    "You cannot Concentrate on spells or other effects."
                ]
            },
            {
                "type": "paragraph",
                "content": "This condition is designed to reduce 'stun-lock' scenarios while still being a potent debuff, especially against spellcasters who rely on concentration."
            }
        ]
    },
    {
        "title": "Deafened",
        "optional": "Standard rule",
        "icon": "mute",
        "subtitle": "You can't hear",
        "description": "A deafened creature has a total inability to hear and automatically fails any checks that require hearing.",
        "reference": "PHB 2024, pg. 367-368.",
        "summary": "You have a total inability to hear and automatically fail any d20 Test that requires hearing. You are immune to effects that rely on sound.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "While less severe than Blinded in combat, this condition prevents a creature from hearing verbal commands, warnings, or the verbal components of spells being cast."
            },
            {
                "type": "list",
                "items": [
                    "You automatically fail any d20 Test that requires hearing."
                ]
            },
            {
                "type": "paragraph",
                "content": "This condition also makes a creature immune to effects that rely on sound, such as a harpy's luring song or the Shatter spell."
            }
        ]
    },
    {
        "title": "Dying",
        "optional": "Standard rule",
        "icon": "deadhead",
        "subtitle": "You are at 0 Hit Points",
        "description": "When you are reduced to 0 Hit Points, you fall Unconscious and must make Death Saving Throws to avoid death.",
        "reference": "PHB 2024, pg. 341.",
        "summary": "At 0 HP, you are Unconscious and must make a Death Save at the start of your turn. Three successes stabilize you; three failures mean you die. A nat 20 revives you with 1 HP.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This is the perilous state between consciousness and death. Your fate is determined by a series of d20 rolls at the start of each of your turns, with success bringing you closer to stability and failure bringing you closer to death."
            },
            {
                "type": "list",
                "items": [
                    "<b>Death Saving Throws:</b> At the start of each of your turns, make a Death Save (a d20 roll with no modifiers). On a 10 or higher, you score a success. On a 9 or lower, a failure.",
                    "<b>3 Successes:</b> You become Stable.",
                    "<b>3 Failures:</b> You die.",
                    "A <b>Natural 1</b> counts as two failures. A <b>Natural 20</b> means you regain 1 Hit Point.",
                    "<b>Damage at 0 HP:</b> Taking damage while at 0 HP causes one Death Save failure (two if the damage is from a critical hit)."
                ]
            },
            {
                "type": "paragraph",
                "content": "Any healing that restores even one hit point will end the dying condition and bring you back to consciousness immediately."
            }
        ]
    },
    {
        "title": "Exhaustion",
        "optional": "Standard rule",
        "icon": "crawl",
        "subtitle": "You are exhausted",
        "description": "A revised condition measured in 10 levels, each giving a cumulative -1 penalty to all d20 Tests.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You suffer a cumulative -1 penalty to all d20 Tests for each level of Exhaustion. At level 5 your speed is halved, at level 7 it becomes 0, and at level 10 you die.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Exhaustion system has been revised to be a more granular and less punishing mechanic at lower levels, acting as a simple, stacking penalty to all of your d20 rolls."
            },
            {
                "type": "list",
                "items": [
                    "<b>Penalty per Level:</b> You suffer a cumulative -1 penalty to all d20 Tests (attack rolls, saving throws, ability checks) for each level of Exhaustion.",
                    "At <b>Level 5</b>, your Speed is also halved.",
                    "At <b>Level 7</b>, your Speed also becomes 0.",
                    "At <b>Level 10</b>, you die.",
                    "Finishing a Long Rest removes 1 level of Exhaustion."
                ]
            },
            {
                "type": "paragraph",
                "content": "This new system makes the first few levels of exhaustion impactful but not debilitating, reserving the harshest penalties for higher levels."
            }
        ]
    },
    {
        "title": "Frightened",
        "optional": "Standard rule",
        "icon": "sharpsmile",
        "subtitle": "You are frightened",
        "description": "Gripped by terror, you have disadvantage on d20 Tests while the source of fear is visible and you cannot move closer to it.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You have disadvantage on all d20 Tests as long as you can see the source of your fear. You also cannot willingly move closer to the source of your fear.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This condition combines a combat penalty with a tactical restriction on movement, making it a powerful tool for battlefield control by forcing a creature to stay at a distance."
            },
            {
                "type": "list",
                "items": [
                    "You have <b>disadvantage on d20 Tests</b> while the source of your fear is within your line of sight.",
                    "You can't willingly move closer to the source of your fear."
                ]
            },
            {
                "type": "paragraph",
                "content": "If you break line of sight with the source of your fear, the disadvantage is suppressed for that moment, but you are still unable to move closer to it."
            }
        ]
    },
    {
        "title": "Grappled",
        "optional": "Standard rule",
        "icon": "grab",
        "subtitle": "You are grappled",
        "description": "Your Speed is 0, and you have disadvantage on attacks against any creature other than your grappler.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "Your Speed is 0, and you have disadvantage on attack rolls against any target except the creature grappling you. The condition ends if the grappler is Incapacitated.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Grappled condition has been updated to be more debilitating, making it a stronger control option for locking down a single target and forcing them to deal with you."
            },
            {
                "type": "list",
                "items": [
                    "Your Speed becomes 0, and you can't benefit from any bonus to your Speed.",
                    "You have <b>disadvantage on attack rolls</b> against any creature other than the one grappling you.",
                    "The condition ends if the grappler is Incapacitated or if you are moved outside the grappler's reach."
                ]
            },
            {
                "type": "paragraph",
                "content": "This change encourages the grappled creature to focus on their immediate threat, rather than attacking other targets with impunity."
            }
        ]
    },
    {
        "title": "Incapacitated",
        "optional": "Standard rule",
        "icon": "internalinjury",
        "subtitle": "You can't take actions",
        "description": "An incapacitated creature is unable to take an Action, Bonus Action, or Reaction, effectively removing them from the action economy.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You cannot take an Action, Bonus Action, or Reaction. You can still use your movement unless another condition prevents it.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This is one of the most severe conditions, as it renders a creature completely passive. It is a component of several other conditions, such as Paralyzed, Stunned, and Unconscious. An incapacitated creature can still move unless another condition prevents it, but they cannot take actions that facilitate movement like Dash."
            }
        ]
    },
    {
        "title": "Invisible",
        "optional": "Standard rule",
        "icon": "invisible",
        "subtitle": "You can't be seen",
        "description": "You are impossible to see without magic or a special sense, granting a powerful advantage in combat and stealth.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You cannot be seen without magic or special senses. You have advantage on your attack rolls, and attack rolls against you have disadvantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Invisibility makes you a superb ambusher and a difficult target, as enemies cannot see you to effectively attack you or defend against your attacks."
            },
            {
                "type": "list",
                "items": [
                    "For the purpose of hiding, you are Heavily Obscured.",
                    "You have <b>advantage on attack rolls</b>.",
                    "Attack rolls against you have <b>disadvantage</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "Remember that spells which require you to see your target cannot target an invisible creature, but area-of-effect spells can still affect them."
            }
        ]
    },
    {
        "title": "Paralyzed",
        "optional": "Standard rule",
        "icon": "spiderweb",
        "subtitle": "You are paralyzed",
        "description": "You are frozen and Incapacitated. Any hit from a nearby attacker becomes a critical hit.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You are Incapacitated, can't move or speak, and automatically fail Strength and Dexterity saves. Attacks against you have advantage, and any hit from an attacker within 5 feet is a critical hit.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This is an extremely dangerous condition that can lead to a character's swift demise. You are completely at the mercy of your foes, unable to act and vulnerable to devastating attacks."
            },
            {
                "type": "list",
                "items": [
                    "You are <b>Incapacitated</b> and can't move or speak.",
                    "Attack rolls against you have <b>advantage</b>.",
                    "Any attack that hits you is a <b>critical hit</b> if the attacker is within 5 feet of you.",
                    "You automatically fail Strength and Dexterity saving throws."
                ]
            },
            {
                "type": "paragraph",
                "content": "The automatic critical hit from adjacent attackers makes this arguably the most dangerous non-lethal condition in the game."
            }
        ]
    },
    {
        "title": "Petrified",
        "optional": "Standard rule",
        "icon": "stonepile",
        "subtitle": "You are transformed into stone",
        "description": "You are transformed into an inanimate object, becoming Incapacitated and highly resistant to damage.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You are transformed into stone, are Incapacitated, and have resistance to all damage. You automatically fail STR and DEX saves, and attacks against you have advantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "A petrified creature is effectively a statue, removed from play and unaware of their surroundings. This condition is usually permanent until cured by powerful magic."
            },
            {
                "type": "list",
                "items": [
                    "You are <b>Incapacitated</b>, can't move or speak, and are unaware of your surroundings.",
                    "Attack rolls against you have <b>advantage</b>.",
                    "You automatically fail Strength and Dexterity saving throws.",
                    "You have <b>resistance to all damage</b>.",
                    "You are immune to poison and disease.",
                    "Your weight is multiplied by ten, and you stop aging."
                ]
            },
            {
                "type": "paragraph",
                "content": "While you are resistant to damage, enough damage can still destroy your petrified form, resulting in death."
            }
        ]
    },
    {
        "title": "Poisoned",
        "optional": "Standard rule",
        "icon": "poisonbottle",
        "subtitle": "You are poisoned",
        "description": "The poison in your system gives you disadvantage on all of your attack rolls and ability checks.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You have disadvantage on all of your attack rolls and ability checks. This does not affect your saving throws.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This condition represents a general debilitation from a toxin. It hampers your effectiveness in almost every task you might attempt that involves an attack or a skill."
            },
            {
                "type": "list",
                "items": [
                    "You have <b>disadvantage on attack rolls and ability checks</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "Notably, the poisoned condition does not affect saving throws, only attack rolls and ability checks, which is a key distinction from other debilitating effects."
            }
        ]
    },
    {
        "title": "Prone",
        "optional": "Standard rule",
        "icon": "crawl",
        "subtitle": "You are prone",
        "description": "You are lying on the ground. This makes you harder to hit from range but easier to hit up close.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You have disadvantage on attack rolls. Attack rolls against you have advantage if the attacker is within 5 feet, and disadvantage otherwise. Standing up costs half your speed.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The prone condition offers a tactical trade-off. It is a defensive boon against ranged attackers but a major liability against melee foes. It also significantly impacts your movement."
            },
            {
                "type": "list",
                "items": [
                    "Your only movement option is to Crawl (which costs double movement) until you stand up.",
                    "Standing up costs half your Speed.",
                    "You have <b>disadvantage on attack rolls</b>.",
                    "An attack roll against you has <b>advantage</b> if the attacker is within 5 feet. Otherwise, the attack roll has <b>disadvantage</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "Standing up costs half of your movement for the turn, which can prevent you from reaching a desired location."
            }
        ]
    },
    {
        "title": "Restrained",
        "optional": "Standard rule",
        "icon": "imprisoned",
        "subtitle": "You are restrained",
        "description": "Your speed is 0, and attacks against you have advantage, while your attacks and Dexterity saves have disadvantage.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "Your Speed is 0. You have disadvantage on attack rolls and Dexterity saving throws. Attack rolls against you have advantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This condition represents being entangled, held in manacles, or caught in a web. It affects your movement, your offense, and your defense simultaneously."
            },
            {
                "type": "list",
                "items": [
                    "Your Speed becomes 0, and you can't benefit from any bonus to your Speed.",
                    "You have <b>disadvantage on attack rolls</b>.",
                    "Attack rolls against you have <b>advantage</b>.",
                    "You have <b>disadvantage on Dexterity saving throws</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "This condition is particularly dangerous as it makes you vulnerable to effects that require Dexterity saving throws, like many damaging spells."
            }
        ]
    },
    {
        "title": "Slowed",
        "optional": "Standard rule",
        "icon": "snail",
        "subtitle": "Your movement is hindered",
        "description": "A new condition that halves your speed, limits your actions, and imposes disadvantage on Dexterity saves.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "Your Speed is halved, you have disadvantage on DEX saves, and you can take either an Action or a Bonus Action (not both). You cannot take the Disengage action.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Slowed condition is a new addition designed to provide a powerful control effect that is less of a complete shutdown than Stunned, affecting multiple aspects of a creature's turn."
            },
            {
                "type": "list",
                "items": [
                    "Your Speed is halved.",
                    "You have disadvantage on Dexterity saving throws.",
                    "You can take either an Action or a Bonus Action on your turn, but not both.",
                    "You can't take the Disengage action."
                ]
            },
            {
                "type": "paragraph",
                "content": "It impacts a creature's mobility, action economy, and defense, making it a versatile tool for controlling the battlefield."
            }
        ]
    },
    {
        "title": "Stunned",
        "optional": "Standard rule",
        "icon": "knockedoutstars",
        "subtitle": "You are stunned",
        "description": "You are Incapacitated, cannot move, and automatically fail Strength and Dexterity saving throws.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You are Incapacitated, can't move, and automatically fail Strength and Dexterity saves. Attack rolls against you have advantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "A stunned creature is almost entirely helpless, removed from the fight for the duration. This is a powerful condition that can swing the momentum of a battle by neutralizing a key threat."
            },
            {
                "type": "list",
                "items": [
                    "You are <b>Incapacitated</b> and can't move.",
                    "Attack rolls against you have <b>advantage</b>.",
                    "You automatically fail Strength and Dexterity saving throws."
                ]
            },
            {
                "type": "paragraph",
                "content": "This condition is often imposed by Monk abilities or certain spells, capable of completely shutting down an enemy for a turn or more."
            }
        ]
    },
    {
        "title": "Suffocating",
        "optional": "Standard rule",
        "icon": "drowning",
        "subtitle": "Holding your breath",
        "description": "Deprived of air, you can survive for a limited time before you drop to 0 hit points and begin dying.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You can hold your breath for 1+CON mod minutes. After that, you survive for CON mod rounds, then drop to 0 HP and are Dying. You cannot be stabilized or healed until you can breathe.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The rules for suffocation create a tense countdown when characters are underwater, in a vacuum, or in an area with unbreathable gas. Survival is measured in minutes, then rounds, before you fall."
            },
            {
                "type": "list",
                "items": [
                    "You can hold your breath for <b>1 + CON modifier</b> minutes (min 30s).",
                    "When out of breath, you can survive for <b>CON modifier</b> rounds (min 1).",
                    "At the start of your next turn after that, you drop to 0 HP and are dying.",
                    "You cannot regain hit points or be stabilized until you can breathe again."
                ]
            },
            {
                "type": "paragraph",
                "content": "The inability to be stabilized or regain hit points makes this situation incredibly dire, as typical methods of saving a dying character will not work."
            }
        ]
    },
    {
        "title": "Unconscious",
        "optional": "Standard rule",
        "icon": "coma",
        "subtitle": "You are unconscious",
        "description": "You are Incapacitated, unaware, and helpless. Any hit from a nearby attacker becomes a critical hit.",
        "reference": "PHB 2024, pg. 368.",
        "summary": "You are Incapacitated, Prone, can't move or speak, and fail STR/DEX saves. Attacks against you have advantage, and hits from within 5 feet are critical hits.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This condition represents being asleep, knocked out, or at 0 hit points. It is nearly identical to the Paralyzed condition in its effects, leaving you completely vulnerable."
            },
            {
                "type": "list",
                "items": [
                    "You are <b>Incapacitated</b>, can't move or speak, and are unaware of your surroundings.",
                    "You drop whatever you're holding and fall Prone.",
                    "Attack rolls against you have <b>advantage</b>.",
                    "Any attack that hits you is a <b>critical hit</b> if the attacker is within 5 feet of you.",
                    "You automatically fail Strength and Dexterity saving throws.",
                    "If you are at 0 Hit Points, you are subject to the Dying rules."
                ]
            },
            {
                "type": "paragraph",
                "content": "A creature is unconscious when they are at 0 hit points. Any healing will restore consciousness. The Sleep spell also renders creatures unconscious without reducing their hit points."
            }
        ]
    },
    {
        "title": "Madness*",
        "optional": "Optional rule",
        "icon": "architectmask",
        "subtitle": "Your mind is damaged",
        "description": "An optional rule system for representing mental trauma with short-term, long-term, and indefinite psychological effects.",
        "reference": "DMG 2024, pg. 236.",
        "summary": "An optional rule for mental trauma from horrific events, inflicting short-term (e.g., Dazed), long-term (e.g., paranoia), or indefinite psychological flaws.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "For campaigns that delve into horror, the Madness rules provide a framework for representing the toll that traumatic events can take on a character's mind, with effects of varying duration and severity."
            },
            {
                "type": "list",
                "items": [
                    "A character might suffer madness from traumatic events, such as failing a Sanity saving throw, seeing an aberration from the Far Realm, or from spells like <i>Contact Other Plane</i>.",
                    "<b>Short-Term Madness (1d10 minutes):</b> Effects like becoming Dazed, being paralyzed with fear, or babbling incoherently.",
                    "<b>Long-Term Madness (1d10 x 10 hours):</b> Effects like developing a phobia, having hallucinations, or suffering from extreme paranoia.",
                    "<b>Indefinite Madness:</b> A permanent change to the character's personality or beliefs, curable only by powerful magic like <i>Greater Restoration</i> or <i>Wish</i>."
                ]
            },
            {
                "type": "paragraph",
                "content": "These rules can create consequences beyond physical damage, adding a layer of psychological depth and danger to a campaign."
            }
        ]
    },
    {
        "title": "Rattled**",
        "optional": "Homebrew rule",
        "icon": "headshot",
        "subtitle": "Your focus is shaken",
        "description": "A homebrew condition less severe than Dazed that specifically targets concentration and mental checks.",
        "summary": "A homebrew condition that gives you disadvantage on Constitution saves to maintain concentration, as well as on Intelligence and Wisdom checks.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This homebrew condition fills a niche for effects that disrupt a spellcaster's focus without completely limiting their actions. It can be inflicted by psychic damage, thunderous blows, or startling events."
            },
            {
                "type": "list",
                "items": [
                    "You have <b>disadvantage on Constitution saving throws</b> made to maintain concentration on a spell or other effect.",
                    "You have <b>disadvantage on Intelligence and Wisdom checks</b>.",
                    "This condition often lasts for 1 minute, or until you succeed on a Wisdom saving throw at the end of your turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "It's a good intermediate step before the more debilitating Dazed condition, offering a milder form of mental disruption that is especially threatening to spellcasters."
            }
        ]
    },
    {
        "title": "Sundered**",
        "optional": "Homebrew rule",
        "icon": "swordbreak",
        "subtitle": "Your armor is damaged",
        "description": "A homebrew condition for gritty campaigns where armor can be damaged, reducing its AC bonus until repaired.",
        "summary": "A homebrew condition where your armor's base AC is reduced by 2. This penalty can stack and may suppress magical properties until the armor is repaired with Smith's Tools.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "For games that want more equipment degradation, the Sundered condition provides a mechanic for breaking armor from powerful blows or corrosive effects, making maintenance important."
            },
            {
                "type": "list",
                "items": [
                    "Your armor's base Armor Class is reduced by 2. This penalty can stack.",
                    "If the penalty meets or exceeds the armor's magical bonus (if any), the magical properties of the armor are suppressed until it is repaired.",
                    "Repairing the Sundered condition typically requires a Smith's Tools check during a Short or Long Rest, and may cost gold for materials."
                ]
            },
            {
                "type": "paragraph",
                "content": "This adds a resource-management element to adventuring, making armor maintenance a part of long-term survival."
            }
        ]
    }
]