[
    {
        "title": "Attack",
        "optional": "Standard rule",
        "icon": "crossedswords",
        "subtitle": "Melee or ranged attack",
        "description": "Make one melee or ranged attack. This action can be modified to perform special maneuvers like Grapple or Shove.",
        "reference": "PHB, pgs. 192, 194-195.",
        "summary": "Make a single melee or ranged attack. As part of this action, you can replace any attack with a special Grapple or Shove maneuver.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Attack action is the foundation of combat, representing a strike with a weapon or an unarmed blow. Certain features may allow you to make multiple attacks with this single action, and you can always substitute an attack for a special maneuver."
            },
            {
                "type": "list",
                "items": [
                    "You may replace any of your attacks with a special melee attack: either a <b>Grapple</b> or a <b>Shove</b>.",
                    "When attacking with a light melee weapon, you can use a bonus action for <b>Two-Weapon Fighting</b> to attack with a different light weapon in your other hand.",
                    "As part of this action, you can draw or sheathe one weapon for free using your single object interaction for the turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "Remember that special maneuvers like Grapple and Shove replace a single attack. If you have the Extra Attack feature, you could use your first attack to shove an enemy prone, then make your second attack against them with advantage."
            }
        ]
    },
    {
        "title": "Cast a Spell",
        "optional": "Standard rule",
        "icon": "magicswirl",
        "subtitle": "Cast time of 1 action",
        "description": "Cast a spell with a casting time of 1 action, the most common type for combat magic.",
        "reference": "PHB, pgs. 192, 202.",
        "summary": "Cast a spell with a 1-action casting time. If you also cast a bonus action spell this turn, this action can only be used for a cantrip. Many spells require concentration to maintain.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This action is the primary way spellcasters influence the world. Effective magic use requires understanding the strict rules governing casting times, targeting, and the critical mechanic of concentration."
            },
            {
                "type": "list",
                "items": [
                    "To target a creature or object, you must have a clear path to it; it cannot be behind total cover.",
                    "If you cast any spell as a bonus action, the only other spell you can cast on the same turn is a cantrip with a casting time of 1 action.",
                    "Many powerful spells require <b>concentration</b>. You can only concentrate on one spell at a time, and you lose concentration if you cast another concentration spell, take damage and fail a Constitution save, or are incapacitated."
                ]
            },
            {
                "type": "paragraph",
                "content": "The concentration mechanic is a crucial tactical challenge. A single stray arrow can break your focus, ending a powerful ongoing effect and potentially wasting a high-level spell slot."
            }
        ]
    },
    {
        "title": "Dash",
        "optional": "Standard rule",
        "icon": "sprint",
        "subtitle": "Double movement speed",
        "description": "Gain extra movement for the current turn equal to your speed.",
        "reference": "PHB, pg. 192.",
        "summary": "Gain an amount of extra movement for the current turn equal to your speed. This effectively doubles your total movement distance but still provokes opportunity attacks.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Dash action is essential for mobility, allowing you to cover vast distances quickly. It is purely for movement and offers no defensive benefit. When you take the Dash action, you gain extra movement for the current turn equal to your speed after applying any modifiers."
            },
            {
                "type": "list",
                "items": [
                    "For example, a character with a 30-foot speed gains 30 feet of extra movement, for a total of 60 feet.",
                    "If your speed is modified (e.g., halved to 15 feet by difficult terrain), the Dash action grants you an additional 15 feet of movement.",
                    "This is not a teleport; you must move through each space, and you will provoke opportunity attacks if you leave an enemy's reach without disengaging."
                ]
            },
            {
                "type": "paragraph",
                "content": "A well-timed Dash can be the difference between reaching a critical objective, saving a downed ally, or being caught out of position."
            }
        ]
    },
    {
        "title": "Disengage",
        "optional": "Standard rule",
        "icon": "journey",
        "subtitle": "Prevent opportunity attacks",
        "description": "For the rest of your turn, your movement does not provoke opportunity attacks.",
        "reference": "PHB, pg. 192.",
        "summary": "Your movement for the rest of the current turn does not provoke any opportunity attacks, allowing you to safely move away from enemies without being attacked.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Disengage is a crucial tactical action for safely maneuvering away from enemies. It grants no extra movement or defense; its sole purpose is to allow you to move without fear of reprisal. This is vital for ranged characters and spellcasters who need to create distance, or for anyone needing to escape a dangerous foe without taking further damage."
            }
        ]
    },
    {
        "title": "Dodge",
        "optional": "Standard rule",
        "icon": "dodging",
        "subtitle": "Focus on defense",
        "description": "Focus entirely on avoiding attacks, granting attackers disadvantage against you and giving you advantage on Dexterity saves.",
        "reference": "PHB, pg. 192.",
        "summary": "Until the start of your next turn, any attack roll against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Dodge action is a powerful defensive tool, best used when anticipating a large volume of attacks or a dangerous area-of-effect spell. Its benefits last until the start of your next turn, but can be lost prematurely."
            },
            {
                "type": "list",
                "items": [
                    "Until the start of your next turn, any attack roll against you has disadvantage if you can see the attacker.",
                    "You make all Dexterity saving throws with advantage.",
                    "You lose these benefits if you become incapacitated or if your speed is reduced to 0."
                ]
            },
            {
                "type": "paragraph",
                "content": "The requirement to see your attacker is important; you cannot effectively dodge an attack from an unseen source. This is an excellent choice for a character holding a choke point or trying to survive until healing arrives."
            }
        ]
    },
    {
        "title": "Don/Doff a Shield",
        "optional": "Standard rule",
        "icon": "shield",
        "subtitle": "Equip or unequip a shield",
        "description": "Use your action to equip a shield by strapping it to your arm, or to take it off.",
        "reference": "PHB, pg. 146.",
        "summary": "It takes one full action to either equip (don) or unequip (doff) a shield. This is more time-consuming than drawing a weapon.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Unlike drawing a weapon, managing a shield is an involved process that consumes your action. This represents the time needed to properly secure or remove it, forcing a choice between defense and other actions for the turn."
            },
            {
                "type": "list",
                "items": [
                    "It takes 1 action to don (equip) a shield.",
                    "It takes 1 action to doff (unequip) a shield.",
                    "In contrast, donning or doffing armor takes several minutes and is impractical in combat."
                ]
            },
            {
                "type": "paragraph",
                "content": "This action cost is a critical tactical consideration for characters who need a free hand for spellcasting or two-weapon fighting."
            }
        ]
    },
    {
        "title": "Escape",
        "optional": "Standard rule",
        "icon": "manacles",
        "subtitle": "Break free from a grapple",
        "description": "Attempt to free yourself from a grapple or non-magical restraints with a contested ability check.",
        "reference": "PHB, pg. 290.",
        "summary": "To escape a grapple, make a Strength (Athletics) or Dexterity (Acrobatics) check contested by the grappler's Strength (Athletics) check.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "When another creature has you grappled, your speed becomes 0. Using your action to Escape pits your physical prowess directly against that of your captor and is the most direct way to regain your mobility."
            },
            {
                "type": "list",
                "items": [
                    "To escape the <b>grappled condition</b>, you must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check contested by the grappler's Strength (Athletics) check.",
                    "Escaping from other restraints, like manacles or webs, may require a Strength or Dexterity check as detailed in the effect's description."
                ]
            },
            {
                "type": "paragraph",
                "content": "The choice between using Strength (Athletics) for brute force or Dexterity (Acrobatics) for agile slipping allows different characters to effectively escape. Forced movement from another source can also end a grapple by moving you out of the grappler's reach."
            }
        ]
    },
    {
        "title": "Grapple",
        "optional": "Standard rule",
        "icon": "grab",
        "subtitle": "Special melee attack",
        "description": "In place of an attack, attempt to seize a creature and give it the grappled condition, reducing its speed to 0.",
        "reference": "PHB, pg. 195.",
        "summary": "Replace one of your attacks to make a Strength (Athletics) check contested by the target's Athletics or Acrobatics. On a success, the target is Grappled and its speed becomes 0.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Grappling is a special melee attack that replaces one of the attacks you could normally make as part of the Attack action. It is a contest of physical prowess, not an attack roll, and deals no damage."
            },
            {
                "type": "list",
                "items": [
                    "If you take the Attack action, you can replace one of your attacks with a grapple attempt.",
                    "The target must be within your reach and no more than one size category larger than you.",
                    "Make a Strength (Athletics) check contested by the target's choice of a Strength (Athletics) or Dexterity (Acrobatics) check. On a success, the target is <b>grappled</b>."
                ]
            },
            {
                "type": "paragraph",
                "content": "Success imposes the grappled condition, which simply reduces the target's speed to 0. A successful grapple is an excellent way to control a single enemy, preventing them from reaching your more vulnerable allies."
            }
        ]
    },
    {
        "title": "Help",
        "optional": "Standard rule",
        "icon": "allforone",
        "subtitle": "Grant an ally advantage",
        "description": "Aid an ally, giving them advantage on the next ability check they make or on their first attack roll against a nearby enemy.",
        "reference": "PHB, pg. 192.",
        "summary": "You can either grant an ally advantage on their next ability check, or grant an ally advantage on their next attack roll against a creature within 5 feet of you.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Help action represents direct collaboration, either by distracting a foe to create an opening or by working together on a task. The action can be used in two distinct ways: to assist with a task or to aid in combat."
            },
            {
                "type": "list",
                "items": [
                    "<b>Aid an Ability Check:</b> Your ally gains advantage on the next check they make for that task, as long as they attempt it before the start of your next turn.",
                    "<b>Aid an Attack:</b> You must be within 5 feet of an enemy. An ally who attacks that enemy before the start of your next turn gains advantage on their first attack roll against it."
                ]
            },
            {
                "type": "paragraph",
                "content": "Using Help to grant advantage on an attack is a powerful tactical move, as it significantly increases the chance to hit and to score a critical hit. It is a fantastic choice for ensuring a critical attack lands, such as a Rogue's Sneak Attack or a Paladin's Divine Smite."
            }
        ]
    },
    {
        "title": "Hide",
        "optional": "Standard rule",
        "icon": "hood",
        "subtitle": "Attempt to become unseen",
        "description": "Make a Dexterity (Stealth) check to become hidden. You cannot hide from a creature that can see you clearly.",
        "reference": "PHB, pgs. 177, 192.",
        "summary": "If you are heavily obscured or behind total cover, you can make a Dexterity (Stealth) check to become hidden. Your check is contested by the passive Perception of nearby creatures.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "To successfully hide, you must first be unseen. This requires being heavily obscured (e.g., in darkness or fog) or behind total cover. Your success is then contested by the passive Perception of any creature that might notice you."
            },
            {
                "type": "list",
                "items": [
                    "You can't hide from a creature that can see you. You must have total cover or be in a heavily obscured area to attempt it.",
                    "Your Dexterity (Stealth) check is contested by the Wisdom (Perception) check of anyone actively searching, or by their passive Wisdom (Perception) score if they aren't.",
                    "You give away your position if you make an attack, move out of cover, or create a loud noise."
                ]
            },
            {
                "type": "paragraph",
                "content": "Being hidden is a powerful state, as it prevents enemies from targeting you directly and typically grants advantage on your next attack roll, making you an unseen attacker."
            }
        ]
    },
    {
        "title": "Improvise",
        "optional": "Standard rule",
        "icon": "juggler",
        "subtitle": "Any action not on this list",
        "description": "Perform any action you can imagine that isn't covered by other rules. The DM determines the outcome and any required checks.",
        "reference": "PHB, pg. 193.",
        "summary": "Perform any action not covered by the rules. The DM determines if it's possible and what, if any, ability check is required to succeed.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This action is a catch-all for creativity. When you want to do something unique like pulling a tapestry down on a foe, kicking sand in an enemy's eyes, or attempting to reason with a monster mid-combat, you are improvising. The Dungeon Master is the final arbiter of what is possible and what kind of ability check, if any, is required."
            }
        ]
    },
    {
        "title": "Interact with an Object",
        "optional": "Standard rule",
        "icon": "snatch",
        "subtitle": "Use a second object",
        "description": "Use your action to interact with a second object on your turn, or for a more complex interaction.",
        "reference": "PHB, pg. 193.",
        "summary": "Use your action for a complex object interaction (like administering a potion) or to interact with a second object after using your one free interaction for the turn.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Your turn comes with one free object interaction. If a task requires more complex manipulation, or if you need to interact with a second object, you must use your action. Understanding this distinction is key to managing your turn's economy."
            },
            {
                "type": "list",
                "items": [
                    "You can interact with one object for free during your turn (e.g., drawing a sword, opening an unlocked door, retrieving an item from a pouch).",
                    "If you want to interact with a <b>second object</b>, you must use your action.",
                    "More <b>complex interactions</b> also require an action, such as administering a potion to an ally, using alchemist's fire, or pulling a complex lever."
                ]
            },
            {
                "type": "paragraph",
                "content": "For example, drawing one sword as part of your move is free. However, sheathing that sword and then drawing a second weapon on the same turn would require using this action."
            }
        ]
    },
    {
        "title": "Ready",
        "optional": "Standard rule",
        "icon": "stopwatch",
        "subtitle": "Set a trigger and action",
        "description": "Prepare to act later in the round by setting a perceivable trigger and choosing an action or move to perform with your reaction.",
        "reference": "PHB, pg. 193.",
        "summary": "Use your action to specify a perceivable trigger and choose an action or move. When the trigger occurs, you can use your reaction to perform your chosen activity.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "The Ready action allows you to interrupt the normal initiative order. You use your action now to set the conditions, and then use your reaction to execute the plan when those conditions are met."
            },
            {
                "type": "list",
                "items": [
                    "First, you decide on a <b>perceivable circumstance</b> as a trigger (e.g., 'When the goblin walks through the doorway').",
                    "Second, you choose the single <b>action or move</b> you will take in response. When the trigger occurs, you can use your reaction to perform it.",
                    "When you ready a spell, you cast it on your turn but hold its energy, which requires <b>concentration</b>. If your concentration is broken before the trigger, the spell slot is lost."
                ]
            },
            {
                "type": "paragraph",
                "content": "This is a powerful tactical option for setting ambushes or countering specific maneuvers. Be warned: if the specified trigger never occurs, you lose both your action and your reaction for the round."
            }
        ]
    },
    {
        "title": "Search",
        "optional": "Standard rule",
        "icon": "magnifyingglass",
        "subtitle": "Actively look for something",
        "description": "Use your action to focus your attention on finding something hidden, such as a trap, secret door, or stealthed creature.",
        "reference": "PHB, pg. 193.",
        "summary": "Make a Wisdom (Perception) check to find hidden creatures or objects, or an Intelligence (Investigation) check to deduce clues from physical evidence.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "While your passive Perception score reflects your general awareness, the Search action represents a focused, deliberate effort. When you take this action, the DM will typically ask for a Wisdom (Perception) check to find hidden objects or creatures, or an Intelligence (Investigation) check to deduce clues from physical evidence."
            }
        ]
    },
    {
        "title": "Shove",
        "optional": "Standard rule",
        "icon": "hand",
        "subtitle": "Special melee attack",
        "description": "In place of an attack, attempt to either knock a creature prone or push it 5 feet away from you.",
        "reference": "PHB, pg. 195.",
        "summary": "Replace one of your attacks to make a Strength (Athletics) check contested by the target's Athletics or Acrobatics. On a success, you can either knock the target Prone or push it 5 feet away.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Like Grapple, Shove is a special melee attack that replaces one of your regular attacks. It's a contest of strength that deals no damage but can reposition your foe or leave them vulnerable."
            },
            {
                "type": "list",
                "items": [
                    "If you take the Attack action, you can replace one of your attacks with a shove attempt.",
                    "The target must be within your reach and no more than one size category larger than you.",
                    "Make a Strength (Athletics) check contested by the target's choice of a Strength (Athletics) or Dexterity (Acrobatics) check. If you win, you can either knock the target <b>prone</b> or push it <b>5 feet</b> directly away from you."
                ]
            },
            {
                "type": "paragraph",
                "content": "Both outcomes are powerful forms of battlefield control. Shoving an enemy prone is an excellent way to set up your melee allies, as it grants them advantage on their subsequent attack rolls against the target."
            }
        ]
    },
    {
        "title": "Stabilize a Creature",
        "optional": "Standard rule",
        "icon": "firstaidkit",
        "subtitle": "Aid a dying creature",
        "description": "Administer first aid to a creature at 0 hit points, making them stable so they no longer need to make death saving throws.",
        "reference": "PHB, pg. 197.",
        "summary": "Make a DC 10 Wisdom (Medicine) check on a creature at 0 HP. On a success, they become stable and no longer need to make Death Saves. A Healer's Kit grants automatic success.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "When an ally is dying, this action is a non-magical way to save their life. A stabilized creature is no longer in immediate danger of death, though they remain unconscious and at 0 hit points. This can be done via a skill check or with a Healer's Kit."
            },
            {
                "type": "list",
                "items": [
                    "You use your action to make a DC 10 Wisdom (Medicine) check. On a success, the creature is stabilized.",
                    "A stable creature doesn't make death saving throws but remains unconscious. It regains 1 hit point after 1d4 hours.",
                    "Using a <b>Healer's Kit</b> on a creature automatically succeeds at this action, expending one use of the kit."
                ]
            },
            {
                "type": "paragraph",
                "content": "The Healer's Kit is an invaluable tool, as it removes the risk of failure associated with the Medicine check. While healing magic is often faster, this action is a crucial option when magical resources are depleted."
            }
        ]
    },
    {
        "title": "Use Class Feature",
        "optional": "Standard rule",
        "icon": "embrassedenergy",
        "subtitle": "Some features use actions",
        "description": "Activate a class or racial feature that explicitly requires an action, as detailed in its description.",
        "reference": "See class page for more information.",
        "summary": "Activate a unique ability from your class, race, or other source that requires a full action to use, as specified in the feature's description.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Many of the unique abilities of a character's class are activated with this action. Always check the specific wording of a feature to see if it requires an action, bonus action, or reaction. Examples include a Paladin's Lay on Hands, a Druid's Wild Shape, or a Fighter's Second Wind."
            }
        ]
    },
    {
        "title": "Administer Potion*",
        "optional": "Optional rule",
        "icon": "healthpotion",
        "subtitle": "Use a potion on another",
        "description": "Use your action to administer a potion to an adjacent creature that is willing or unconscious.",
        "reference": "DMG, pg. 141.",
        "summary": "As a specific 'Interact with an Object' action, you can use your action to administer a potion to an adjacent willing or unconscious creature.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This is a specific application of the 'Interact with an Object' action, clarifying that giving a potion to someone else requires your full attention. It is a vital tactic for saving a downed ally."
            },
            {
                "type": "list",
                "items": [
                    "Administering a potion requires you to be within 5 feet of the target creature.",
                    "This is most often used to bring a dying (0 HP) ally back to consciousness and into the fight.",
                    "While drinking a potion yourself is also an action, many DMs use a popular house rule allowing it as a bonus action. Administering one to another always remains an action."
                ]
            },
            {
                "type": "paragraph",
                "content": "This action is a critical lifeline, often being the fastest way for a non-magical character to bring a fallen comrade back from the brink of death."
            }
        ]
    },
    {
        "title": "Climb onto a Bigger Creature*",
        "optional": "Optional rule",
        "icon": "mountainclimbing",
        "subtitle": "Climb a larger foe",
        "description": "Attempt to scale a creature at least two sizes larger, treating its body as terrain to gain an advantageous position.",
        "reference": "DMG, pg. 271.",
        "summary": "Make a contested Athletics or Acrobatics check to climb onto a creature at least two sizes larger. On a success, you move with it and gain advantage on attacks against it.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This cinematic optional rule allows for dynamic encounters with colossal foes. Success allows you to move into the creature's space and cling to it, gaining significant advantages."
            },
            {
                "type": "list",
                "items": [
                    "The target must be at least <b>two sizes larger</b> than you.",
                    "Make a Strength (Athletics) or Dexterity (Acrobatics) check contested by the target's Dexterity (Acrobatics) check.",
                    "On a success, you move into the target's space, treat its space as difficult terrain, and gain <b>advantage on attack rolls</b> against it."
                ]
            },
            {
                "type": "paragraph",
                "content": "Once attached, you move with the creature. The target can use its action to try and dislodge you with another contested check, making this a risky but rewarding maneuver."
            }
        ]
    },
    {
        "title": "Disarm*",
        "optional": "Optional rule",
        "icon": "swordbreak",
        "subtitle": "Knock item from enemy's grasp",
        "description": "Use a weapon attack to knock an item, such as a weapon or focus, from an enemy's hand.",
        "reference": "DMG, pg. 271.",
        "summary": "Make an attack roll contested by the target's Athletics or Acrobatics check. If you win, the attack deals no damage but forces the target to drop one held item.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This optional rule provides a highly effective combat maneuver. Instead of dealing damage, a successful attack forces the defender to drop an item of your choice by pitting your attack roll against their physical skills."
            },
            {
                "type": "list",
                "items": [
                    "The attacker makes an attack roll contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check.",
                    "If the attacker wins, the attack deals no damage but forces the target to drop one held item of the attacker's choice.",
                    "The attacker has disadvantage on the roll if the target is holding the item with two or more hands."
                ]
            },
            {
                "type": "paragraph",
                "content": "This maneuver can dramatically shift the tide of battle by removing a key weapon or spellcasting focus, effectively neutralizing an enemy's primary threat."
            }
        ]
    },
    {
        "title": "Mark*",
        "optional": "Optional rule",
        "icon": "crossmark",
        "subtitle": "Focus on one foe",
        "description": "An optional rule that lets you single out an enemy you hit, making your opportunity attacks against them more effective.",
        "reference": "DMG, pg. 271.",
        "summary": "When you hit a creature with a melee attack, you can mark it. Any opportunity attack you make against the marked target has advantage and doesn't expend your reaction.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This rule adds a tactical layer for melee fighters, allowing them to 'lock down' an opponent. This is not an action itself, but a rider effect you can apply when you hit with a melee attack."
            },
            {
                "type": "list",
                "items": [
                    "When you hit a creature with a melee attack, you can <b>mark it</b> until the end of your next turn.",
                    "Any opportunity attack you make against the marked target has <b>advantage</b>.",
                    "The opportunity attack <b>doesn't expend your reaction</b>, but you can't make another one on the same turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "The most powerful aspect of this rule is that the opportunity attack does not use your reaction, freeing it up for other uses like casting <b>Shield</b> or making another opportunity attack against an unmarked foe."
            }
        ]
    },
    {
        "title": "Overrun*",
        "optional": "Optional rule",
        "icon": "shieldbash",
        "subtitle": "Run through a hostile space",
        "description": "As an action or bonus action, force your way through an enemy's space with a contested Strength check.",
        "reference": "DMG, pg. 272.",
        "summary": "As an action or bonus action, make a Strength (Athletics) check contested by an enemy's Athletics. If you win, you can move through their space once this turn. You have advantage if you are larger.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This maneuver allows you to bull-rush past an enemy blocking your path. It is a contest of raw strength that is modified by the relative sizes of the two creatures."
            },
            {
                "type": "list",
                "items": [
                    "As an action or a bonus action, make a Strength (Athletics) check contested by the enemy's Strength (Athletics) check.",
                    "You have <b>advantage</b> on this check if you are larger than the enemy, and <b>disadvantage</b> if you are smaller.",
                    "If you win, you can move through the enemy's space once this turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "Success allows you to pass through their space, which is still difficult terrain, but it does not displace the enemy. This is a great way to break through a defensive line to reach a high-priority target."
            }
        ]
    },
    {
        "title": "Parley*",
        "optional": "Optional rule",
        "icon": "conversation",
        "subtitle": "Negotiate mid-combat",
        "description": "Use your action to de-escalate a fight and begin a one-minute conversation with a hostile creature.",
        "reference": "TCE, pg. 148.",
        "summary": "Make a contested Charisma check (Deception, Intimidation, or Persuasion vs. Insight) to make a hostile creature cease hostilities for 1 minute, allowing for negotiation.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This social action provides a formal mechanic for trying to talk your way out of a fight that's already started. Success pauses the conflict, giving you a chance to negotiate via a contested social skill check."
            },
            {
                "type": "list",
                "items": [
                    "Make a Charisma (Deception, Intimidation, or Persuasion) check contested by the target's Wisdom (Insight) check.",
                    "You have <b>disadvantage</b> on the check if you or your companions are fighting the creature.",
                    "On a success, the target ceases hostilities for 1 minute. The parley ends if you or your allies do anything harmful to it."
                ]
            },
            {
                "type": "paragraph",
                "content": "A successful parley provides a crucial window to resolve the conflict without further violence. If the parley fails, the creature is immune to further attempts from you for 24 hours, so make your one chance count."
            }
        ]
    },
    {
        "title": "Shove Aside*",
        "optional": "Optional rule",
        "icon": "push",
        "subtitle": "Special melee attack variant",
        "description": "A variant of the Shove attack that pushes a creature 5 feet to an adjacent space instead of away from you.",
        "reference": "DMG, pg. 272.",
        "summary": "As a variant of the Shove action, you can make your Strength (Athletics) check at disadvantage. If you succeed, you move the target 5 feet to a different unoccupied space within your reach.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This optional rule adds more tactical depth to the Shove action, allowing for precise repositioning of enemies. The maneuver is more difficult, imposing disadvantage on your check."
            },
            {
                "type": "list",
                "items": [
                    "When you take the Shove action, you can declare you are shoving the target aside.",
                    "You have <b>disadvantage</b> on your Strength (Athletics) check when you do so.",
                    "If you succeed, you move the target 5 feet to a different, unoccupied space within your reach."
                ]
            },
            {
                "type": "paragraph",
                "content": "Unlike a standard shove, this allows you to move an enemy to your side, setting up flanking or moving them into a hazard without pushing them out of melee range."
            }
        ]
    },
    {
        "title": "Tumble*",
        "optional": "Optional rule",
        "icon": "acrobatic",
        "subtitle": "Tumble through a hostile space",
        "description": "As an action or bonus action, deftly move through an enemy's space with a contested Dexterity check.",
        "reference": "DMG, pg. 272.",
        "summary": "As an action or bonus action, make a Dexterity (Acrobatics) check contested by an enemy's Acrobatics. If you win, you can move through their space once this turn.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "As an alternative to the Strength-based Overrun, this maneuver allows an agile character to slip past an opponent using a contest of agility."
            },
            {
                "type": "list",
                "items": [
                    "As an action or a bonus action, make a Dexterity (Acrobatics) check contested by the hostile creature's Dexterity (Acrobatics) check.",
                    "If you win the contest, you can move through the hostile creature's space once this turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "This is an ideal maneuver for nimble characters like Rogues or Monks who need to reposition on a crowded battlefield. Like Overrun, the enemy's space is still difficult terrain."
            }
        ]
    },
    {
        "title": "Brace**",
        "optional": "Homebrew rule",
        "icon": "pikeman",
        "subtitle": "Prepare for an incoming charge",
        "description": "A homebrew action to set your weapon against a charging foe, allowing a powerful counter-attack as a reaction.",
        "reference": "Common Homebrew",
        "summary": "Use your action to prepare an attack. As a reaction, you can attack a creature that moves at least 10 feet towards you, dealing one extra weapon damage die on a hit.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This action emulates the classic trope of setting a polearm against a charging enemy. It trades your action for a potent, damage-boosted reaction against an enemy that moves at least 10 feet towards you."
            },
            {
                "type": "list",
                "items": [
                    "As an action, you take the Brace stance. If a hostile creature moves at least 10 feet in a straight line towards you and enters your weapon's reach, you can use your reaction to make one melee attack against it.",
                    "If this attack hits, it deals one extra weapon damage die.",
                    "You lose the benefits of the Brace if you move before making the attack."
                ]
            },
            {
                "type": "paragraph",
                "content": "This is a high-risk, high-reward action that requires predicting enemy movement. If no enemy charges you, you have effectively wasted your action for the turn."
            }
        ]
    },
    {
        "title": "Called Shot**",
        "optional": "Homebrew rule",
        "icon": "archerytarget",
        "subtitle": "Target a specific body part",
        "description": "A house rule allowing an attacker to take a penalty on their attack roll for a chance to inflict a specific debilitating effect.",
        "reference": "Common Homebrew",
        "summary": "A house rule where you take a penalty on your attack roll (typically -5) to target a specific body part and apply a debilitating effect on a hit, such as disarming an arm shot.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "Called shots introduce tactical complexity, allowing players to aim for effects beyond simple damage. The specifics of penalties and effects are determined by the DM, but generally involve taking an accuracy penalty for a debilitating effect."
            },
            {
                "type": "list",
                "items": [
                    "The attacker declares their target (e.g., an arm, leg, or head) and takes a penalty to their attack roll, typically -5.",
                    "On a successful hit, the attack may impart a special effect, such as forcing the target to drop an item (arm), reducing its speed (leg), or giving it disadvantage on its next attack (head)."
                ]
            },
            {
                "type": "paragraph",
                "content": "This system provides more tactical options, allowing characters to strategically disable opponents rather than just depleting hit points. It can slow down combat, so pre-defined charts are recommended."
            }
        ]
    },
    {
        "title": "Cleave**",
        "optional": "Homebrew rule",
        "icon": "axeswing",
        "subtitle": "Carry over damage to another foe",
        "description": "A house rule allowing excess melee damage from a killing blow to carry over to an adjacent enemy.",
        "reference": "Common Homebrew (adapted from DMG, pg. 272)",
        "summary": "A house rule where, if your melee attack reduces a creature to 0 HP, you can apply any excess damage to another creature within 5 feet (usually requiring a new attack roll).",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This popular rule makes martial characters feel more powerful when facing hordes of weak enemies, allowing a massive damage roll to feel impactful even if the initial target was nearly dead. It allows excess damage from a fatal blow to be redirected."
            },
            {
                "type": "list",
                "items": [
                    "When your melee attack reduces a creature to 0 hit points, you can apply any excess damage to another creature within 5 feet of the original target and within your reach.",
                    "This typically requires a new attack roll against the second creature.",
                    "This effect is usually limited to one additional target per turn to maintain game balance."
                ]
            },
            {
                "type": "paragraph",
                "content": "This is an adaptation of an optional rule in the Dungeon Master's Guide and is a very popular and satisfying house rule for martial characters."
            }
        ]
    },
    {
        "title": "Intimidating Presence**",
        "optional": "Homebrew rule",
        "icon": "sharpsmile",
        "subtitle": "Frighten a foe without a weapon",
        "description": "A house rule allowing a character to use their action to frighten a creature with a contested Charisma check.",
        "reference": "Common Homebrew",
        "summary": "Use your action to make a Charisma (Intimidation) check contested by a target's Wisdom (Insight). On a success, the target is Frightened of you until the end of your next turn.",
        "bullets": [
            {
                "type": "paragraph",
                "content": "This provides a non-magical way for charismatic or terrifying characters to impose the Frightened condition, using their force of personality as a weapon. It pits your force of personality against a target's mental resolve."
            },
            {
                "type": "list",
                "items": [
                    "As an action, choose one creature you can see within 30 feet. Make a Charisma (Intimidation) check contested by the target's Wisdom (Insight) check.",
                    "If you win the contest, the target is <b>frightened</b> of you until the end of your next turn."
                ]
            },
            {
                "type": "paragraph",
                "content": "Success imposes the Frightened condition, giving the target disadvantage on attack rolls and ability checks while they can see you, and preventing them from moving closer. This can be a powerful control option, especially for classes without access to magical fear effects."
            }
        ]
    }
]